src/Documents/СчетНаОплату/СчетНаОплату.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетНаОплату</name>
  <basedOn>Document.ГТД</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>ГТД</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоллар</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/СчетНаОплату/ManagerModule.bsl
Процедура СчетНаОплату ( ТабДок, Ссылка) Экспорт
	
	макет = Документы.СчетНаОплату.Получитьмакет ( "СчетНаОплату" );
	с = "
	|выбрать
	|	ГТД как ГТД,
	|	Дата как Дата,
	|	Комментарий как Комментарий,
	|	Контрагент как Контрагент,
	|	НазначениеПлатежа как НазначениеПлатежа,
	|	Номер как Номер,
	|	Организация как Организация,
	|	Ответственный как Ответственный,
	|	Сумма как Сумма,
	|	СуммаДоллар как СуммаДоллар,
	|	Счет
	|из
	|	Документ.СчетНаОплату
	|где
	|	Ссылка = &Ссылка
	|";
	запрос = Новый Запрос ( с );
	запрос.Параметры.Вставить ( "Ссылка", Ссылка );
	выборка = запрос.Выполнить ().Выбрать ();
	заголовок = макет.ПолучитьОбласть ( "Заголовок" );
	шапка = макет.ПолучитьОбласть ( "Шапка" );
	ТабДок.Очистить ();
	Пока выборка.Следующий() Цикл
		ТабДок.Вывести ( заголовок );
		Шапка.Параметры.Заполнить ( выборка );
		ТабДок.Вывести ( шапка );
	КонецЦикла;
	
КонецПроцедуры
